garyPenhook/PyAvrOCD/svd/atmega64rfr2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWRCTRL</name>
      <description>Power Controller</description>
      <baseAddress>0x00800055</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xDA</offset>
        <size>0x9</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DPDS0</name>
          <description>Port Driver Strength Register 0</description>
          <addressOffset>0xE1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PBDRV</name>
              <description>Driver Strength Port B</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAD_IO_2MA</name>
                  <description>2 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_4MA</name>
                  <description>4 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_6MA</name>
                  <description>6 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_8MA</name>
                  <description>8 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDDRV</name>
              <description>Driver Strength Port D</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAD_IO_2MA</name>
                  <description>2 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_4MA</name>
                  <description>4 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_6MA</name>
                  <description>6 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_8MA</name>
                  <description>8 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEDRV</name>
              <description>Driver Strength Port E</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAD_IO_2MA</name>
                  <description>2 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_4MA</name>
                  <description>4 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_6MA</name>
                  <description>6 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_8MA</name>
                  <description>8 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFDRV</name>
              <description>Driver Strength Port F</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAD_IO_2MA</name>
                  <description>2 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_4MA</name>
                  <description>4 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_6MA</name>
                  <description>6 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_8MA</name>
                  <description>8 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDS1</name>
          <description>Port Driver Strength Register 1</description>
          <addressOffset>0xE2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGDRV</name>
              <description>Driver Strength Port G</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAD_IO_2MA</name>
                  <description>2 mA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_4MA</name>
                  <description>4 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_6MA</name>
                  <description>6 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_IO_8MA</name>
                  <description>8 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DRTRAM0</name>
          <description>Data Retention Configuration Register #0</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENDRT</name>
              <description>Enable SRAM Data Retention</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRTSWOK</name>
              <description>DRT Switch OK</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRTRAM1</name>
          <description>Data Retention Configuration Register #1</description>
          <addressOffset>0xDF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENDRT</name>
              <description>Enable SRAM Data Retention</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRTSWOK</name>
              <description>DRT Switch OK</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRTRAM2</name>
          <description>Data Retention Configuration Register #2</description>
          <addressOffset>0xDE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENDRT</name>
              <description>Enable SRAM Data Retention</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRTSWOK</name>
              <description>DRT Switch OK</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRTRAM3</name>
          <description>Data Retention Configuration Register #3</description>
          <addressOffset>0xDD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENDRT</name>
              <description>Enable SRAM Data Retention</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRTSWOK</name>
              <description>DRT Switch OK</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LLCR</name>
          <description>Low Leakage Voltage Regulator Control Register</description>
          <addressOffset>0xDA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LLENCAL</name>
              <description>Enable Automatic Calibration</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLSHORT</name>
              <description>Short Lower Calibration Circuit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLTCO</name>
              <description>Temperature Coefficient of Current Source</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLCAL</name>
              <description>Calibration Active</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLCOMP</name>
              <description>Comparator Output</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLDONE</name>
              <description>Calibration Done</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LLDRH</name>
          <description>Low Leakage Voltage Regulator Data Register (High-Byte)</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LLDRH</name>
              <description>High-Byte Data Register Bits</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CALIBRATION_LIMIT_FOR_FAST_PROCESS_CORNER_HIGH_OUTPUT_VOLTAGE</name>
                  <description>Calibration limit for fast process corner/high output voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALIBRATION_LIMIT_FOR_SLOW_PROCESS_CORNER_LOW_OUTPUT_VOLTAGE</name>
                  <description>Calibration limit for slow process corner/low output voltage</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LLDRL</name>
          <description>Low Leakage Voltage Regulator Data Register (Low-Byte)</description>
          <addressOffset>0xDB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LLDRL</name>
              <description>Low-Byte Data Register Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CALIBRATION_LIMIT_FOR_FAST_PROCESS_CORNER_HIGH_OUTPUT_VOLTAGE</name>
                  <description>Calibration limit for fast process corner/high output voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALIBRATION_LIMIT_FOR_SLOW_PROCESS_CORNER_LOW_OUTPUT_VOLTAGE</name>
                  <description>Calibration limit for slow process corner/low output voltage</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PUD</name>
              <description>Pull-up Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRXPR</name>
          <description>Transceiver Pin Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRXRST</name>
              <description>Force Transceiver Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLPTR</name>
              <description>Multi-purpose Transceiver Control Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
