garyPenhook/PyAvrOCD/svd/atmega64rfr2.svd
        <register>
          <name>SHORT_ADDR_1</name>
          <description>Transceiver MAC Short Address Register (High Byte)</description>
          <addressOffset>0xA3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SHORT_ADDR_</name>
              <description>MAC Short Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRXFBEND</name>
          <description>End of frame buffer</description>
          <addressOffset>0x141</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TRXFBST</name>
          <description>Start of frame buffer</description>
          <addressOffset>0xC2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TRX_CTRL_0</name>
          <description>Reserved</description>
          <addressOffset>0x85</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PMU_IF_INV</name>
              <description>PMU IF Inverse</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_START</name>
              <description>Start of Phase Measurement Unit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_EN</name>
              <description>Enable Phase Measurement Unit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res7</name>
              <description>Reserved</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRX_CTRL_1</name>
          <description>Transceiver Control Register 1</description>
          <addressOffset>0x86</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_TX_FLT</name>
              <description>Enable PLL TX filter</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_AUTO_CRC_ON</name>
              <description>Enable Automatic CRC Calculation</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_2_EXT_EN</name>
              <description>Connect Frame Start IRQ to TC1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_EXT_EN</name>
              <description>External PA support enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRX_CTRL_2</name>
          <description>Transceiver Control Register 2</description>
          <addressOffset>0x8E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OQPSK_DATA_RATE</name>
              <description>Data Rate Selection</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATE_250KB</name>
                  <description>250 kb/s (IEEE 802.15.4 compliant)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATE_500KB</name>
                  <description>500 kb/s</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATE_1000KB</name>
                  <description>1000 kb/s</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATE_2000KB</name>
                  <description>2000 kb/s</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_SAFE_MODE</name>
              <description>RX Safe Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRX_RPC</name>
          <description>Transceiver Reduced Power Consumption Control</description>
          <addressOffset>0x98</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XAH_RPC_EN</name>
              <description>Smart Receiving in Extended Operating Modes Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IPAN_RPC_EN</name>
              <description>Smart Receiving Mode IPAN Handling Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res0</name>
              <description>Reserved</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_RPC_EN</name>
              <description>PLL Smart Receiving Mode Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDT_RPC_EN</name>
              <description>Smart Receiving Mode Reduced Sensitivity Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RPC_EN</name>
              <description>Receiver Smart Receiving Mode Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RPC_CTRL</name>
              <description>Smart Receiving Mode Timing</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVATES_MINIMUM_POWER_SAVING_BEHAVIOUR_FOR_SMART_RECEIVING_MODE</name>
                  <description>Activates minimum power saving behaviour for smart receiving mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVATES_MAXIMUM_POWER_SAVING_BEHAVIOUR_FOR_SMART_RECEIVING_MODE</name>
                  <description>Activates maximum power saving behaviour for smart receiving mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRX_STATE</name>
          <description>Transceiver State Control Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRX_CMD</name>
              <description>State Control Command</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_NOP</name>
                  <description>NOP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_TX_START</name>
                  <description>TX_START</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_FORCE_TRX_OFF</name>
                  <description>FORCE_TRX_OFF</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_FORCE_PLL_ON</name>
                  <description>FORCE_PLL_ON</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_RX_ON</name>
                  <description>RX_ON</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_TRX_OFF</name>
                  <description>TRX_OFF</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_PLL_ON</name>
                  <description>PLL_ON (TX_ON)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_RX_AACK_ON</name>
                  <description>RX_AACK_ON</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_TX_ARET_ON</name>
                  <description>TX_ARET_ON</description>
                  <value>25</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRAC_STATUS</name>
              <description>Transaction Status</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRAC_SUCCESS</name>
                  <description>SUCCESS (RX_AACK, TX_ARET)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRAC_SUCCESS_DATA_PENDING</name>
                  <description>SUCCESS_DATA_PENDING (TX_ARET)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRAC_SUCCESS_WAIT_FOR_ACK</name>
                  <description>SUCCESS_WAIT_FOR_ACK (RX_AACK)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRAC_CHANNEL_ACCESS_FAILURE</name>
                  <description>CHANNEL_ACCESS_FAILURE (TX_ARET)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRAC_NO_ACK</name>
                  <description>NO_ACK (TX_ARET)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRAC_INVALID</name>
                  <description>INVALID (RX_AACK, TX_ARET)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRX_STATUS</name>
          <description>Transceiver Status Register (read-only for debugger)</description>
          <addressOffset>0x83</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRX_STATUS</name>
              <description>Transceiver Main Status</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P_ON</name>
                  <description>P_ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_RX</name>
                  <description>BUSY_RX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_TX</name>
                  <description>BUSY_TX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ON</name>
                  <description>RX_ON</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRX_OFF</name>
                  <description>TRX_OFF</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_ON</name>
                  <description>PLL_ON</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>SLEEP</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_RX_AACK</name>
                  <description>BUSY_RX_AACK</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_TX_ARET</name>
                  <description>BUSY_TX_ARET</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_AACK_ON</name>
                  <description>RX_AACK_ON</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ARET_ON</name>
                  <description>TX_ARET_ON</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_TRANSITION_IN_PROGRESS</name>
                  <description>STATE_TRANSITION_IN_PROGRESS</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TST_STATUS</name>
              <description>Test mode status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TST_DISABLED</name>
                  <description>Test mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TST_ENABLED</name>
                  <description>Test mode is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_STATUS</name>
              <description>CCA Status Result</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA_BUSY</name>
                  <description>Channel indicated as busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_IDLE</name>
                  <description>Channel indicated as idle.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_DONE</name>
              <description>CCA Algorithm Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA_NOT_FIN</name>
                  <description>CCA calculation not finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_FIN</name>
                  <description>CCA calculation finished</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TST_CTRL_DIGI</name>
          <description>Transceiver Digital Test Control Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TST_CTRL_DIG</name>
              <description>Digital Test Controller Register</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_NO_TEST_IS_ACTIVE</name>
                  <description>NORMAL (no test is active)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TST_CONT_TX_CONTINUOUS_TRANSMIT</name>
                  <description>TST_CONT_TX (continuous transmit)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TST_RX_LENGTH</name>
          <description>Transceiver Received Frame Length Register</description>
          <addressOffset>0xBD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_LENGTH</name>
              <description>Received Frame Length</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION_NUM</name>
          <description>Device Identification Register (Version Number) (read-only for debugger)</description>
          <addressOffset>0x9F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VERSION_NUM</name>
              <description>Version Number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV_B</name>
                  <description>Revision B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV_A</name>
                  <description>Revision A</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
